ERP.belugaerp/src/Enums/бг_ВариантыОпределенияДатыДействияСкидокНаценок/бг_ВариантыОпределенияДатыДействияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыОпределенияДатыДействияСкидокНаценок</name>
  <enumValues>
    <name>ПоДатеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПоДатеВходящегоДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПоДатеОтгрузки</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/InformationRegisters/бг_НастройкиОпределенияДатыДействияСкидокНаценок/бг_НастройкиОпределенияДатыДействияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НастройкиОпределенияДатыДействияСкидокНаценок</name>
  <resources>
    <name>ВариантОпределенияДатыДействия</name>
    <type>
      <types>EnumRef.бг_ВариантыОпределенияДатыДействияСкидокНаценок</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_АвтоматическиФормироватьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидВзаиморасчетов</name>
    <type>
      <types>CatalogRef.бг_ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидПеревозки</name>
    <comment>Вид перевозки для заполнения в транспортном разделе</comment>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_МаксимальнаяСтраховаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОтсрочкаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПроцентФинансированияФакторинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ШаблонТекстаНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_НастройкиОплатыЧерезФакторинговуюКомпанию</name>
    <attributes>
      <name>КонтрагентФактор</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетФактора</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Enums/бг_ВариантыОпределенияДатыДействияСкидокНаценок/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ВариантПоУмолчанию() Экспорт
	
	Возврат ПоДатеДокумента;
	
КонецФункции

Функция ВариантОпределенияДатыДействия(ВхПараметрыЗапроса) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫБОР ТИПЗНАЧЕНИЯ(Р.Получатель)
		|		КОГДА ТИП(Справочник.Партнеры) ТОГДА 1
		|		КОГДА ТИП(Справочник.Контрагенты) ТОГДА 2
		|		КОГДА ТИП(Справочник.ДоговорыКонтрагентов) ТОГДА 3
		|		КОГДА ТИП(Справочник.битПунктыНазначения) ТОГДА 4
		|	КОНЕЦ Приоритет,
		|	Получатель
		|ПОМЕСТИТЬ ВТ_ПриоритетыНастроек
		|ИЗ
		|	РегистрСведений.бг_НастройкиОпределенияДатыДействияСкидокНаценок Р
		|ГДЕ
		|	Р.Организация = &Организация
		|	И Р.Получатель В (&Партнер, &Контрагент, &Договор, &бг_ПунктНазначения)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	0 Приоритет,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.бг_НастройкиОпределенияДатыДействияСкидокНаценок Р
		|ГДЕ
		|	Р.Организация = &Организация
		|	И Р.Получатель = НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Р.ВариантОпределенияДатыДействия
		|ИЗ
		|	РегистрСведений.бг_НастройкиОпределенияДатыДействияСкидокНаценок Р
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыНастроек Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ МАКСИМУМ(Приоритет) ИЗ ВТ_ПриоритетыНастроек) М
		|		ПО Т.Приоритет = М.Приоритет
		|	ПО Р.Организация = &Организация
		|		И Р.Получатель = Т.Получатель"
	);
	
	ПараметрыЗапроса = Запрос.НайтиПараметры();
	Для каждого ПараметрЗапроса из ПараметрыЗапроса Цикл
		ЗначениеПараметра = Неопределено;
		Если ВхПараметрыЗапроса.Свойство(ПараметрЗапроса.Имя, ЗначениеПараметра) Тогда
			Запрос.УстановитьПараметр(ПараметрЗапроса.Имя, ЗначениеПараметра);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ВариантПоУмолчанию();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка[0];
	КонецЕсли;
	
КонецФункции

#КонецОбласти
